# Elevation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCLevelInfo..::..Elevation Property
IFCLevelInfo Class See Also
---
The elevation of the level.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double Elevation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Elevation As Double
	Get
```

Visual C++
---
```text
public:
property double Elevation {
	double get ();
}
```

# See Also
IFCLevelInfo Class
Autodesk.Revit.DB.IFC Namespace